Revit 2026 API

# ScrollbarVisibility Enumeration

---

Lists all the visibility types of the scrollbar in the preview view.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ScrollbarVisibility
```
```vb
Public Enumeration ScrollbarVisibility
```
```cpp
public enum class ScrollbarVisibility
```
```fsharp
type ScrollbarVisibility
```

| Member name | Value | Description |
| --- | --- | --- |
| Both | 3 | The both scrollbars are visible. |
| Horizontal | 1 | The horizontal scrollbar is visible. |
| None | 0 | No scrollbars are visible. |
| Vertical | 2 | The vertical scrollbar is visible. |

#### Reference

Autodesk.Revit.UI Namespace